src/cf/Catalogs/desНастройкиДействийПриОбмене.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>desНастройкиДействийПриОбмене</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбщихПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстанавливатьОбмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторнаяОтправка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.desВариантыНастроекОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.desДействияПриОбмене</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтпечатокОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>44</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтпечатокПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>44</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗадание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОбработка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеСхемаИсточникаДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеКомпоновщикНастроек</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеПараметры</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЗначенияПоУмолчанию</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлятьПоЭлектроннойПочте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПолучателяУведомления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/desНастройкиДействийПриОбмене/Ext/ManagerModule.bsl
Функция ПолучитьДействие(Организация, Контрагент, Действие) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	desНастройкиДействийПриОбменеДействия.Ссылка КАК Действие,
		|	desНастройкиДействийПриОбменеДействия.ОтпечатокОбработки,
		|	desНастройкиДействийПриОбменеДействия.ОтпечатокПараметров,
		|	desНастройкиДействийПриОбменеДействия.Включено,
		|	desНастройкиДействийПриОбменеДействия.РегламентноеЗадание,
		|	desНастройкиДействийПриОбменеДействия.ХранилищеОбработка,
		|	desНастройкиДействийПриОбменеДействия.ХранилищеСхемаИсточникаДанных,
		|	desНастройкиДействийПриОбменеДействия.ХранилищеКомпоновщикНастроек,
		|	desНастройкиДействийПриОбменеДействия.ХранилищеПараметры,
		|	desНастройкиДействийПриОбменеДействия.Ссылка.ПрофильОбмена
		|ИЗ
		|	Справочник.desНастройкиДействийПриОбмене.Действия КАК desНастройкиДействийПриОбменеДействия
		|ГДЕ
		|	desНастройкиДействийПриОбменеДействия.Ссылка.Организация = &Организация
		|	И desНастройкиДействийПриОбменеДействия.Ссылка.Контрагент = &Контрагент
		|	И desНастройкиДействийПриОбменеДействия.Действие = &Действие";
	
	Запрос.УстановитьПараметр("Действие", Действие);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе	
		
		СтруктураРезультат = Новый Структура("Действие,ОтпечатокОбработки,ОтпечатокПараметров,Включено,РегламентноеЗадание,ХранилищеОбработка,ХранилищеСхемаИсточникаДанных,ХранилищеКомпоновщикНастроек,ХранилищеПараметры,ПрофильОбмена");
		
		Выборка = Результат.Выбрать();	
		
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураРезультат,Выборка);
		
		Возврат СтруктураРезультат;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИдентификаторыДляОбменаЭДО(Организация, Контрагент, СпособОбменаЭД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	desНастройкиДействийПриОбменеДействия.Ссылка.ИдентификаторЭДО КАК ИдентификаторЭДОКонтрагента,
		|	desНастройкиДействийПриОбменеДействия.Ссылка.ПрофильОбмена.ИдентификаторОрганизации КАК ИдентификаторЭДООрганизации,
		|	desНастройкиДействийПриОбменеДействия.Ссылка.ПрофильОбмена.ОператорЭДО КАК НаименованиеОператора,
		|	desНастройкиДействийПриОбменеДействия.Ссылка.ПрофильОбмена.ОператорЭДОИНН КАК ИННОператора,
		|	desНастройкиДействийПриОбменеДействия.Ссылка.ПрофильОбмена.ОператорЭДОИд КАК ИдентификаторЭДООператора
		|ИЗ
		|	Справочник.desНастройкиДействийПриОбмене.Действия КАК desНастройкиДействийПриОбменеДействия
		|ГДЕ
		|	desНастройкиДействийПриОбменеДействия.Действие = Значение(Справочник.desДействияПриОбмене.ЭДОУПД)
		|	И desНастройкиДействийПриОбменеДействия.Ссылка.Организация = &Организация
		|	И desНастройкиДействийПриОбменеДействия.Ссылка.Контрагент = &Контрагент
		|	И desНастройкиДействийПриОбменеДействия.Ссылка.ПрофильОбмена.СпособОбменаЭД = &СпособОбменаЭД
		|	И НЕ desНастройкиДействийПриОбменеДействия.Ссылка.ПометкаУдаления";

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СпособОбменаЭД", СпособОбменаЭД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		СтруктураВозврата = Новый Структура("ИдентификаторЭДОКонтрагента,ИдентификаторЭДООрганизации,ИдентификаторЭДООператора,НаименованиеОператора,ИННОператора");
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,ВыборкаДетальныеЗаписи);
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		ВызватьИсключение "Для контрагента " +Строка(Контрагент)+ "не установлена настройка обмена ЭДО - " + Строка(СпособОбменаЭД);
		
	КонецЕсли;
	
КонецФункции
